/*
*   gpio 配置
*/
#include <stc12c5a60s2.h>
#include "bsp_gpio.h"

extern void delayMS(unsigned int tim);

/*********************************************************************************************
函数名：ledStart
作  用: 开机LED闪烁
参  数：闪烁次数 n
返回值：无
**********************************************************************************************/
void ledStart(void)
{
	//LED开
	P2 &= 0x0f;
	P0 &= 0xf0;
	delayMS(2500);
	
	P2 |= 0xf0;
}


/*********************************************************************************************
函数名：GPIO_Init
作  用: GPIO管脚初始化
参  数：无
返回值：无
**********************************************************************************************/
void GPIO_Init(void)
{
	//P0口,标准双向口
	P0M0 = 0x0;
	P0M1 = 0x0;

	//P1口,标准双向口 P13 作为PWM输出     7654 3210
	P1M0 = 0x08;                       // 0000 1000
	P1M1 = 0x0;                          // 0000 0000 
	
	//P2口  P27~P24 用于LED指示，配置成推挽输出
	P2M0 = 0xf0;  
	P2M1 = 0x0;

	//P37~P36 用于可控硅控制，配置成推挽输出
	P3M0 = 0xf0;
	P3M1 = 0x0;

	//P4口
	P4SW = 0x70; //设置管脚为IO口 0111 0000
	P4M0 = 0x30;  //0011 0000 P45 P44 控制BUZ 设置为推挽输出
	P4M1 = 0x0;


	P0 &= 0x0; //按键扫描 
	P1 &= 0xf7;
	P2 = (P2 | 0xf0) & 0xf0; //  1111 0000 LED低电平有效，开机为高
	P3 |= 0xf0; //P3.4~3.7 可控硅控制，低电平有效
	P4 &= 0x0; //蜂鸣器端口P44 P45  74HC595数据线P46 开机都为低

}


